app/views/x/messages/index.html.erb

      <% @messages.each do |message| %>
      <% if message.users.blank? %>
---
SELECT "users".* FROM "users" INNER JOIN "senders" ON "users"."id" = "senders"."user_id" WHERE "senders"."message_id" = $1  [["message_id", 5]]