app/controllers/x/messages_controller.rb

SELECT "messages".* FROM "messages"  WHERE (message IS NOT NULL)  ORDER BY "messages"."id" ASC
---
  def index
  	@messages = Message.mails.order("id DESC")

SELECT DISTINCT "users".* FROM "users"   ORDER BY "users"."id" ASC
---
  def edit
  	setup_message
  	@q = User.search(params[:q])
	  @users = @q.result(distinct: true).order(:id)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 22]]
---
  def connect
    setup_message
    users = User.find(params[:user_ids])