app/controllers/x/notifications_controller.rb

SELECT "messages".* FROM "messages"  WHERE (text IS NOT NULL)  ORDER BY id DESC
---
  def index
    @messages = Message.notifications.order("id DESC")

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "messages" ("created_at", "reply_to", "text", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-06-28 12:15:06.330679"], ["reply_to", 3], ["text", "hoghogehoge"], ["updated_at", "2014-06-28 12:15:06.330679"]]
SELECT "users".* FROM "users"
---
  def create
    @message = Message.new(message_params)
    @message.reply_to = User.find(params[:reply_to]) if params[:reply_to].present?
    @message.users << User.all