app/controllers/x/users_controller.rb

  def index
  	@q = User.search(params[:q])
	  @users = @q.result(distinct: true).order(:id)
---
SELECT "users".* FROM "users"   ORDER BY "users"."id" ASC
SELECT DISTINCT "users".* FROM "users"   ORDER BY "users"."id" ASC