app/controllers/home_controller.rb

SELECT "messages".* FROM "messages" INNER JOIN "senders" ON "messages"."id" = "senders"."message_id" WHERE "senders"."user_id" = $1 AND (message IS NOT NULL)  ORDER BY id DESC  [["user_id", 1]]
---
  def show
  	@notifications = current_user.messages.notifications.order("id DESC")