app/controllers/messages_controller.rb

  def new
  	@message = Message.new
    @sender = User.find(params[:owner]) if params[:owner]
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def create
  	@message = current_user.own_messages.new(message_params)
    @message.users << User.find(params[:sender]) if params[:sender]
---
INSERT INTO "messages" ("created_at", "message", "owner_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-06-28 11:18:39.815829"], ["message", "8cb329c1-eaff-4a3f-8b32-a3e55fa6f8d4.jpeg"], ["owner_id", 1], ["updated_at", "2014-06-28 11:18:39.815829"]]
INSERT INTO "senders" ("created_at", "message_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-06-28 11:40:03.581580"], ["message_id", 2], ["updated_at", "2014-06-28 11:40:03.581580"], ["user_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1