app/controllers/receives_controller.rb

SELECT  "messages".* FROM "messages" INNER JOIN "senders" ON "messages"."id" = "senders"."message_id" WHERE "senders"."user_id" = $1 AND (message IS NOT NULL)  ORDER BY id DESC LIMIT 1  [["user_id", 1]]
---
  def index
  	@messages = current_user.messages.mails.order("id DESC")

SELECT  "messages".* FROM "messages" INNER JOIN "senders" ON "messages"."id" = "senders"."message_id" WHERE "senders"."user_id" = $1 AND "messages"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 4]]
---
  def show
  	@message = current_user.messages.find(params[:id])

SELECT "messages".* FROM "messages" INNER JOIN "senders" ON "messages"."id" = "senders"."message_id" WHERE "senders"."user_id" = $1 AND (text IS NOT NULL)  ORDER BY id DESC  [["user_id", 1]]
---
  def list
    @notifications = current_user.messages.notifications.order("id DESC")