app/controllers/tutorial_controller.rb

  def confirm
  	@message = Message.find(params[:m])
---
SELECT  "messages".* FROM "messages"  WHERE "messages"."id" = $1 LIMIT 1  [["id", 4]]